In [1]:
import sqlite3
import pandas as pd

# Load the CSV into a DataFrame
df = pd.read_csv('used_car_price.csv')

#We will sqlite3 library and create a connection
conn = sqlite3.connect("sql_db.db")

# Write the DataFrame to the SQLite database as a table
df.to_sql('cars', conn, index=False, if_exists='replace')

#Load the sql module to ipython
%load_ext sql

#Load local dataset
%sql sqlite:///sql_db.db

## SQL NULL Values
- A field with a NULL value is a field with no value.
- IS NULL Syntax: select col1 from my_table where col1 is null;
- IS NOT NULL Syntax: select col1 from my_table where col1 is not null;

In [5]:
%%sql

select brand, model, model_year from cars where accident is null limit 3;

 * sqlite:///sql_db.db
Done.

[('RAM', '2500 Big Horn', 2012),
 ('Jeep', 'Gladiator Sport', 2021),
 ('Acura', 'RDX w/A-Spec Package', 2023)]

## SQL Update Statement
- The `update` statement is used to modify the existing records in a table.
- Syntax: update table_name set col1=value1, col2=value2 where condition;

In [11]:
%%sql

select * from cars limit 1;

 * sqlite:///sql_db.db
Done.

[(0, 'Tavlav', 'Lucky24', 2007, 213000, 'Gasoline', '172.0HP 1.6L 4 Cylinder Engine Gasoline Fuel', 'A/T', 'Yellow', 'Gray', 'None reported', 'Yes', 4200)]

In [10]:
%%sql
update cars 
set brand="Tavlav", model = "Lucky24" 
where id = 0;

 * sqlite:///sql_db.db
1 rows affected.

[]

In [12]:
%%sql
-- update multiple data

update cars set brand='Tavlav' where brand="Genesis";

 * sqlite:///sql_db.db
969 rows affected.

[]

## SQL Delete Statement
- The `DELETE` statement is used to delete existing records in a table.
- Syntax: `delete from table_name where condition;`

In [14]:
%%sql

delete from cars where model_year < 1990;

 * sqlite:///sql_db.db
12 rows affected.

[]

## LIMIT Clause
- Show the limited number of equivalent example.

In [17]:
%%sql
-- SELECT TOP clause is used to specify the number of records to return.

select * from cars limit 3;

 * sqlite:///sql_db.db
Done.

[(0, 'Tavlav', 'Lucky24', 2007, 213000, 'Gasoline', '172.0HP 1.6L 4 Cylinder Engine Gasoline Fuel', 'A/T', 'Yellow', 'Gray', 'None reported', 'Yes', 4200),
 (1, 'Lincoln', 'LS V8', 2002, 143250, 'Gasoline', '252.0HP 3.9L 8 Cylinder Engine Gasoline Fuel', 'A/T', 'Silver', 'Beige', 'At least 1 accident or damage reported', 'Yes', 4999),
 (2, 'Chevrolet', 'Silverado 2500 LT', 2002, 136731, 'E85 Flex Fuel', '320.0HP 5.3L 8 Cylinder Engine Flex Fuel Capability', 'A/T', 'Blue', 'Gray', 'None reported', 'Yes', 13900)]

In [18]:
%%sql
-- limit using order by

select * from cars order by price desc limit 3;

 * sqlite:///sql_db.db
Done.

[(220, 'Ford', 'F-150 XLT', 2021, 26315, 'Gasoline', '3.5L V6 24V PDI DOHC Twin Turbo', '10-Speed Automatic', 'Agate Black Metallic', 'Black', 'None reported', 'Yes', 2954083),
 (1880, 'Chrysler', '300C Base', 2003, 55900, 'Gasoline', '340.0HP 5.7L 8 Cylinder Engine Gasoline Fuel', '5-Speed A/T', 'Beige', 'Beige', 'None reported', 'Yes', 2954083),
 (13838, 'Toyota', 'Highlander SE', 2014, 85000, 'Gasoline', '3.5L V6 24V PDI DOHC', '8-Speed Automatic', 'Green', 'Black', 'None reported', 'Yes', 2954083)]